
/**
* \page ManualPage Мануал
*
*  Примеры форматирования
*  ======================
*
*  Примеры используемых тегов Doxygen
*  ----------------------------------
*
* \pre
*  Предусловие, которое следует выполнить, чтобы можно было этим
*  воспользоваться.
*
* \note
*  Это неочевидные подробности работы функции.
*
* \warning
*  ВАЖНО! На это следует обратить внимание.
*
* \deprecated
*  Устаревшая функция/класс, не использовать в новом коде.
*
* \bug
*  Страшный баг, требует немедленного излечения.
*
* \todo
*  Сделай это, ну пожааааааааааааааааалуйста!.
*
* \test
*  Тестовый объект.
*
* ### Примеры описания классов/функций
*
*  ClassName
*
* ### Пример формирования таблицы
*
* The following text **table** produces a full HTML table with its
* first column centered, and the last column left aligned.
*
* | Return Code | Meaning                |
* | :---------: | :--------------------- |
* | 0           | Success                |
* | 10          | Unexpected end-of-file |
* | 20          | Communication error    |
* | 30          | Invalid input          |
*
*  Ссылки
*  ------
*
*  [Boost](http://www.boost.org/) \n
*  <http://www.boost.org/> \n
*  [Boost можно скачать здесь].
*
*  [Boost можно скачать здесь]: http://www.boost.org/ "Boost"
*
*  Блоки кода
*  ----------

~~~~~~~~~~~~~~~~~{.cpp}
#pragma once
~~~~~~~~~~~~~~~~~

*  Checkbox'ы
*  ----------
*
* - \checked Выполненное требование.
* - \checked Выполненное требование.
* - \checked Выполненное требование.
* - \unchecked Не выполненное требование.
*
*                
*  --------------
*/
