
/**
* \page RequirementsPage Исходные требования
*  
*  Требования
*  ==========
*  
*  Обеспечить
*  ----------
*  
*  - \checked Командный файл, генерирующий документацию решения.
*  - \checked Соответствие стандартной структуре решения.
*  - \checked Все необходимые для полного описания решения файлы документации.
*  - \checked Все примеры должны быть доступны на одной странице (странице 
*  описания решения).
*  
*  Список требуемых примеров
*  -------------------------
*  
*  - \unchecked Используемых тегов Doxygen.
*  - \unchecked Описание класса.
*  - \unchecked Описание функции.
*  - \unchecked Описание файла.
*  - \unchecked Объединение классов в группы.
*/
